Repository: whit3rabbit/turbospark
Catalog: swift/TurboSparkApp/Localization/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, hi, id, it, ja, ko, nl, pl, pt_br, ru, sv, tr, uk, vi, zh_hans, zh_hant

source: Memory Load Guard
ar: حماية حمل الذاكرة
de: Speicherlastschutz
es: Protección de carga de memoria
fr: Protection de charge mémoire
he: הגנת עומס זיכרון
hi: मेमोरी लोड गार्ड
id: Penjaga Beban Memori
it: Protezione carico di memoria
ja: メモリ負荷ガード
ko: 메모리 로드 가드
nl: Geheugenbelastingbescherming
pl: Ochrona obciążenia pamięci
pt_br: Proteção de carga de memória
ru: Защита от перегрузки памяти
sv: Minnesbelastningsskydd
tr: Bellek Yükü Koruması
uk: Захист від перевантаження пам'яті
vi: Bảo vệ tải bộ nhớ
zh_hans: 内存负载保护
zh_hant: 記憶體負載保護

source: Memory by context window
ar: الذاكرة حسب نافذة السياق
de: Speicher nach Kontextfenster
es: Memoria por ventana de contexto
fr: Mémoire par fenêtre de contexte
he: זיכרון לפי חלון הקשר
hi: संदर्भ विंडो के अनुसार मेमोरी
id: Memori berdasarkan jendela konteks
it: Memoria per finestra di contesto
ja: コンテキスト長別のメモリ
ko: 컨텍스트 창별 메모리
nl: Geheugen per contextvenster
pl: Pamięć według okna kontekstu
pt_br: Memória por janela de contexto
ru: Память по окну контекста
sv: Minne efter kontextfönster
tr: Bağlam penceresine göre bellek
uk: Пам'''ять за вікном контексту
vi: Bộ nhớ theo cửa sổ ngữ cảnh
zh_hans: 按上下文窗口分配的内存
zh_hant: 依上下文視窗分配的記憶體

source: Memory cost per window is unavailable for this model.
ar: تكلفة الذاكرة لكل نافذة غير متاحة لهذا النموذج.
de: Der Speicherbedarf pro Fenster ist für dieses Modell nicht verfügbar.
es: El coste de memoria por ventana no está disponible para este modelo.
fr: Le coût mémoire par fenêtre n'est pas disponible pour ce modèle.
he: עלות הזיכרון לכל חלון אינה זמינה עבור מודל זה.
hi: इस मॉडल के लिए प्रति विंडो मेमोरी लागत उपलब्ध नहीं है।
id: Biaya memori per jendela tidak tersedia untuk model ini.
it: Il costo di memoria per finestra non è disponibile per questo modello.
ja: このモデルではウィンドウごとのメモリ使用量を取得できません。
ko: 이 모델은 창별 메모리 비용을 확인할 수 없습니다.
nl: Het geheugengebruik per venster is niet beschikbaar voor dit model.
pl: Koszt pamięci na okno jest niedostępny dla tego modelu.
pt_br: O custo de memória por janela não está disponível para este modelo.
ru: Расход памяти на окно недоступен для этой модели.
sv: Minnesåtgången per fönster är inte tillgänglig för den här modellen.
tr: Bu model için pencere başına bellek maliyeti yok.
uk: Витрати пам'яті на вікно недоступні для цієї моделі.
vi: Không có dữ liệu bộ nhớ theo từng cửa sổ cho mô hình này.
zh_hans: 此模型无法获取每个窗口的内存开销。
zh_hant: 此模型無法取得每個視窗的記憶體開銷。

source: Memory pressure
ar: ضغط الذاكرة
de: Speicherdruck
es: Presión de memoria
fr: Pression mémoire
he: עומס זיכרון
hi: मेमोरी दबाव
id: Tekanan memori
it: Pressione memoria
ja: メモリ負荷
ko: 메모리 압박
nl: Geheugendruk
pl: Obciążenie pamięci
pt_br: Pressão de memória
ru: Нагрузка на память
sv: Minnestryck
tr: Bellek baskısı
uk: Тиск на пам'ять
vi: Áp lực bộ nhớ
zh_hans: 内存压力
zh_hant: 記憶體壓力

source: Menu Bar & Server
ar: شريط القوائم والخادم
de: Menüleiste & Server
es: Barra de menús y servidor
fr: Barre de menus et serveur
he: שורת תפריטים ושרת
hi: मेनू बार और सर्वर
id: Bilah Menu & Server
it: Barra dei menu e server
ja: メニューバーとサーバー
ko: 메뉴 막대 및 서버
nl: Menubalk & server
pl: Pasek menu i serwer
pt_br: Barra de menus e servidor
ru: Строка меню и сервер
sv: Menyrad och server
tr: Menü Çubuğu ve Sunucu
uk: Рядок меню та сервер
vi: Thanh menu & Máy chủ
zh_hans: 菜单栏与服务器
zh_hant: 選單列與伺服器

source: Minimum AutoFit context length
ar: أدنى طول سياق لـ AutoFit
de: Minimale AutoFit-Kontextlänge
es: Longitud mínima de contexto de AutoFit
fr: Longueur de contexte minimale pour AutoFit
he: אורך הקשר מזערי ל-AutoFit
hi: AutoFit न्यूनतम संदर्भ लंबाई
id: Panjang konteks minimum AutoFit
it: Lunghezza minima del contesto per AutoFit
ja: AutoFit の最小コンテキスト長
ko: AutoFit 최소 컨텍스트 길이
nl: Minimale AutoFit-contextlengte
pl: Minimalna długość kontekstu AutoFit
pt_br: Comprimento mínimo de contexto do AutoFit
ru: Минимальная длина контекста AutoFit
sv: Minsta kontextlängd för AutoFit
tr: En düşük AutoFit bağlam uzunluğu
uk: Мінімальна довжина контексту AutoFit
vi: Độ dài ngữ cảnh tối thiểu của AutoFit
zh_hans: AutoFit 最小上下文长度
zh_hant: AutoFit 最小上下文長度

source: Mirror Endpoint ($HF_ENDPOINT)
ar: نقطة نهاية المرآة ($HF_ENDPOINT)
de: Spiegel-Endpunkt ($HF_ENDPOINT)
es: Punto de conexión espejo ($HF_ENDPOINT)
fr: Point de terminaison miroir ($HF_ENDPOINT)
he: נקודת קצה מראה ($HF_ENDPOINT)
hi: मिरर एंडपॉइंट ($HF_ENDPOINT)
id: Endpoint cermin ($HF_ENDPOINT)
it: Endpoint mirror ($HF_ENDPOINT)
ja: ミラーエンドポイント ($HF_ENDPOINT)
ko: 미러 엔드포인트($HF_ENDPOINT)
nl: Mirror-eindpunt ($HF_ENDPOINT)
pl: Punkt końcowy kopii lustrzanej ($HF_ENDPOINT)
pt_br: Endpoint espelho ($HF_ENDPOINT)
ru: Зеркальная конечная точка ($HF_ENDPOINT)
sv: Spegelslutpunkt ($HF_ENDPOINT)
tr: Yansı uç noktası ($HF_ENDPOINT)
uk: Дзеркальна кінцева точка ($HF_ENDPOINT)
vi: Điểm cuối bản sao ($HF_ENDPOINT)
zh_hans: 镜像端点 ($HF_ENDPOINT)
zh_hant: 鏡像端點 ($HF_ENDPOINT)

source: MoE (Mixture of Experts) Architecture Spotlight
ar: إضاءة على بنية MoE (خليط الخبراء)
de: Im Fokus: MoE-Architektur (Mixture of Experts)
es: Foco en la arquitectura MoE (mezcla de expertos)
fr: Zoom sur l'architecture MoE (mélange d'experts)
he: זרקור על ארכיטקטורת MoE (תערובת מומחים)
hi: MoE (मिक्सचर ऑफ़ एक्सपर्ट्स) आर्किटेक्चर पर नज़र
id: Sorotan arsitektur MoE (Mixture of Experts)
it: Focus sull'architettura MoE (Mixture of Experts)
ja: MoE (Mixture of Experts) アーキテクチャの紹介
ko: MoE(전문가 혼합) 아키텍처 소개
nl: Uitgelicht: MoE-architectuur (Mixture of Experts)
pl: Architektura MoE (mieszanka ekspertów) w centrum uwagi
pt_br: Destaque da arquitetura MoE (mistura de especialistas)
ru: Обзор архитектуры MoE (смесь экспертов)
sv: Fokus på MoE-arkitekturen (Mixture of Experts)
tr: MoE (Uzman Karışımı) mimarisine yakın bakış
uk: Огляд архітектури MoE (суміш експертів)
vi: Tiêu điểm kiến trúc MoE (hỗn hợp chuyên gia)
zh_hans: MoE (专家混合) 架构聚焦
zh_hant: MoE (專家混合) 架構聚焦

source: MoE Streaming
ar: بث MoE
es: Streaming MoE
fr: Streaming MoE
he: הזרמת MoE
hi: MoE स्ट्रीमिंग
id: Streaming MoE
it: Streaming MoE
ja: MoEストリーミング
ko: MoE 스트리밍
pl: Streaming MoE
pt_br: Streaming MoE
ru: MoE Стриминг
sv: MoE-strömning
tr: MoE Akışı
uk: MoE Стрімінг
vi: Truyền phát MoE
zh_hans: MoE流式
zh_hant: MoE串流

source: MoE models stream weights directly from fast NVMe storage and only cache active experts in **~2-4 GB RAM**. This delivers **26B-35B parameter intelligence** on Apple Silicon without exhausting memory.
ar: تبث نماذج MoE الأوزان مباشرة من تخزين NVMe السريع ولا تخزن مؤقتا سوى الخبراء النشطين في **نحو 2-4 غيغابايت من الذاكرة**. هذا يوفر **ذكاء بحجم 26-35 مليار معامل** على Apple Silicon دون استنفاد الذاكرة.
de: MoE-Modelle streamen Gewichte direkt aus schnellem NVMe-Speicher und halten nur aktive Experten in **~2-4 GB RAM** vor. So liefern sie **Intelligenz mit 26B-35B Parametern** auf Apple Silicon, ohne den Speicher zu erschöpfen.
es: Los modelos MoE transmiten los pesos directamente desde almacenamiento NVMe rápido y solo mantienen en caché los expertos activos en **~2-4 GB de RAM**. Así ofrecen **inteligencia de 26B-35B parámetros** en Apple Silicon sin agotar la memoria.
fr: Les modèles MoE diffusent les poids directement depuis un stockage NVMe rapide et ne mettent en cache que les experts actifs dans **~2-4 Go de RAM**. Cela offre une **intelligence de 26B-35B paramètres** sur Apple Silicon sans épuiser la mémoire.
he: מודלי MoE משדרים משקלים ישירות מאחסון NVMe מהיר ושומרים במטמון רק את המומחים הפעילים ב-**כ-2-4 ג'יגה-בייט זיכרון**. כך מתקבלת **בינה בסדר גודל של 26-35 מיליארד פרמטרים** על Apple Silicon בלי למצות את הזיכרון.
hi: MoE मॉडल तेज़ NVMe स्टोरेज से सीधे वेट स्ट्रीम करते हैं और केवल सक्रिय एक्सपर्ट को **~2-4 GB RAM** में कैश करते हैं। इससे Apple Silicon पर मेमोरी समाप्त किए बिना **26B-35B पैरामीटर की बुद्धिमत्ता** मिलती है।
id: Model MoE mengalirkan bobot langsung dari penyimpanan NVMe cepat dan hanya menyimpan pakar aktif di **~2-4 GB RAM**. Ini menghadirkan **kecerdasan 26B-35B parameter** di Apple Silicon tanpa menghabiskan memori.
it: I modelli MoE trasmettono i pesi direttamente da un'archiviazione NVMe veloce e mantengono in cache solo gli esperti attivi in **~2-4 GB di RAM**. Così offrono **intelligenza da 26B-35B parametri** su Apple Silicon senza esaurire la memoria.
ja: MoE モデルは高速な NVMe ストレージから重みを直接ストリーミングし、アクティブなエキスパートだけを **約 2-4 GB の RAM** にキャッシュします。これにより、メモリを使い果たすことなく Apple Silicon 上で **260 億-350 億パラメータの知能** を実現します。
ko: MoE 모델은 빠른 NVMe 저장소에서 가중치를 직접 스트리밍하고 활성 전문가만 **약 2-4GB RAM**에 캐시합니다. 덕분에 메모리를 소진하지 않고 Apple Silicon에서 **260억-350억 매개변수 수준의 지능**을 제공합니다.
nl: MoE-modellen streamen gewichten rechtstreeks van snelle NVMe-opslag en cachen alleen actieve experts in **~2-4 GB RAM**. Zo leveren ze **intelligentie van 26B-35B parameters** op Apple Silicon zonder het geheugen uit te putten.
pl: Modele MoE strumieniują wagi bezpośrednio z szybkiej pamięci NVMe i buforują tylko aktywnych ekspertów w **~2-4 GB RAM**. Dzięki temu zapewniają **inteligencję rzędu 26-35 mld parametrów** na Apple Silicon bez wyczerpywania pamięci.
pt_br: Os modelos MoE transmitem os pesos diretamente do armazenamento NVMe rápido e mantêm em cache apenas os especialistas ativos em **~2-4 GB de RAM**. Isso entrega **inteligência de 26B-35B parâmetros** no Apple Silicon sem esgotar a memória.
ru: Модели MoE передают веса напрямую из быстрого хранилища NVMe и кэшируют только активных экспертов в **~2-4 ГБ ОЗУ**. Это дает **интеллект уровня 26B-35B параметров** на Apple Silicon без исчерпания памяти.
sv: MoE-modeller strömmar vikter direkt från snabb NVMe-lagring och cachar bara aktiva experter i **~2-4 GB RAM**. Det ger **intelligens med 26-35 miljarder parametrar** på Apple Silicon utan att tömma minnet.
tr: MoE modelleri ağırlıkları doğrudan hızlı NVMe depolamadan akıtır ve yalnızca etkin uzmanları **~2-4 GB RAM** içinde önbelleğe alır. Böylece belleği tüketmeden Apple Silicon üzerinde **26B-35B parametrelik zekâ** sunar.
uk: Моделі MoE передають ваги безпосередньо зі швидкого сховища NVMe й кешують лише активних експертів у **~2-4 ГБ ОЗП**. Це дає **інтелект рівня 26-35 мільярдів параметрів** на Apple Silicon без вичерпання пам'яті.
vi: Các mô hình MoE truyền trọng số trực tiếp từ bộ nhớ NVMe tốc độ cao và chỉ lưu đệm các chuyên gia đang hoạt động trong **khoảng 2-4 GB RAM**. Nhờ đó, Apple Silicon đạt **trí tuệ cỡ 26-35 tỷ tham số** mà không cạn bộ nhớ.
zh_hans: MoE 模型直接从高速 NVMe 存储流式读取权重，仅将活跃专家缓存在 **约 2-4 GB 内存** 中。这让 Apple Silicon 在不耗尽内存的情况下获得 **260 亿-350 亿参数的智能**。
zh_hant: MoE 模型直接從高速 NVMe 儲存串流讀取權重，僅將活躍專家快取在 **約 2-4 GB 記憶體** 中。這讓 Apple Silicon 在不耗盡記憶體的情況下獲得 **260 億-350 億參數的智慧**。

source: Mode
ar: الوضع
de: Modus
es: Modo
he: מצב
hi: मोड
it: Modalità
ja: モード
ko: 모드
nl: Modus
pl: Tryb
pt_br: Modo
ru: Режим
sv: Läge
tr: Mod
uk: Режим
vi: Chế độ
zh_hans: 模式
zh_hant: 模式

source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
he: מודל
hi: मॉडल
it: Modello
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
sv: Modell
uk: Модель
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

source: Model Catalog
ar: كتالوج النماذج
de: Modellkatalog
es: Catálogo de modelos
fr: Catalogue de modèles
he: קטלוג מודלים
hi: मॉडल कैटलॉग
id: Katalog model
it: Catalogo dei modelli
ja: モデルカタログ
ko: 모델 카탈로그
nl: Modelcatalogus
pl: Katalog modeli
pt_br: Catálogo de modelos
ru: Каталог моделей
sv: Modellkatalog
tr: Model kataloğu
uk: Каталог моделей
vi: Danh mục mô hình
zh_hans: 模型目录
zh_hant: 模型目錄

source: Model Highlights & Features
ar: أبرز ميزات النموذج وخصائصه
de: Modell-Highlights und Funktionen
es: Aspectos destacados y funciones del modelo
fr: Points forts et fonctionnalités du modèle
he: עיקרי המודל ותכונותיו
hi: मॉडल की मुख्य बातें और सुविधाएं
id: Sorotan dan fitur model
it: Punti salienti e funzionalità del modello
ja: モデルの特長と機能
ko: 모델 주요 특징 및 기능
nl: Hoogtepunten en functies van het model
pl: Najważniejsze cechy i funkcje modelu
pt_br: Destaques e recursos do modelo
ru: Ключевые особенности и возможности модели
sv: Modellens höjdpunkter och funktioner
tr: Model öne çıkanlar ve özellikler
uk: Ключові особливості та функції моделі
vi: Điểm nổi bật và tính năng của mô hình
zh_hans: 模型亮点与功能
zh_hant: 模型亮點與功能

source: Model Settings
ar: إعدادات النموذج
de: Modelleinstellungen
es: Ajustes del modelo
fr: Paramètres du modèle
he: הגדרות מודל
hi: मॉडल सेटिंग्स
id: Pengaturan Model
it: Impostazioni modello
ja: モデル設定
ko: 모델 설정
nl: Modelinstellingen
pl: Ustawienia modelu
pt_br: Configurações do Modelo
ru: Настройки модели
sv: Modellinställningar
tr: Model Ayarları
uk: Параметри моделі
vi: Cài đặt mô hình
zh_hans: 模型设置
zh_hant: 模型設定

source: Model defaults
ar: الإعدادات الافتراضية للنموذج
de: Modellstandardwerte
es: Valores predeterminados del modelo
fr: Valeurs par défaut du modèle
he: ברירות המחדל של המודל
hi: मॉडल डिफ़ॉल्ट
id: Default model
it: Impostazioni predefinite del modello
ja: モデルの既定値
ko: 모델 기본값
nl: Standaardwaarden van model
pl: Domyślne ustawienia modelu
pt_br: Padrões do modelo
ru: Значения модели по умолчанию
sv: Modellens standardvärden
tr: Model varsayılanları
uk: Типові значення моделі
vi: Mặc định của mô hình
zh_hans: 模型默认值
zh_hant: 模型預設值

source: Model favorites and scan paths
ar: المفضلة ومسارات الفحص للطُرز
de: Modell-Favoriten und Scanpfade
es: Favoritos de modelos y rutas de escaneo
fr: Favoris de modèles et chemins d'analyse
he: מועדפי מודלים ונתיבי סריקה
hi: मॉडल पसंदीदा और स्कैन पथ
id: Favorit model dan jalur pemindaian
it: Preferiti dei modelli e percorsi di scansione
ja: モデルのお気に入りとスキャンパス
ko: 모델 즐겨찾기 및 스캔 경로
nl: Modelfavorieten en scanpaden
pl: Ulubione modele i ścieżki skanowania
pt_br: Favoritos de modelos e caminhos de varredura
ru: Избранные модели и пути сканирования
sv: Modellfavoriter och sökvägar
tr: Model favorileri ve tarama yolları
uk: Обрані моделі та шляхи сканування
vi: Mục yêu thích của mô hình và đường dẫn quét
zh_hans: 模型收藏与扫描路径
zh_hant: 模型收藏與掃描路徑

source: Model hub
ar: مركز النماذج
de: Modell-Hub
es: Centro de modelos
fr: Hub de modeles
he: מרכז המודלים
hi: मॉडल हब
id: Hub Model
it: Hub modelli
ja: モデルハブ
ko: 모델 허브
pl: Centrum modeli
pt_br: Hub de modelos
ru: Каталог моделей
sv: Modellhubb
tr: Model Merkezi
uk: Центр моделей
vi: Trung tâm mô hình
zh_hans: 模型中心
zh_hant: 模型中心

source: Model loading guardrails
ar: حواجز حماية تحميل النماذج
de: Schutzmechanismen beim Laden von Modellen
es: Salvaguardas de carga de modelos
fr: Garde-fous de chargement des modèles
he: מעקות בטיחות לטעינת מודלים
hi: मॉडल लोडिंग गार्डरेल
id: Pagar pengaman pemuatan model
it: Protezioni per il caricamento dei modelli
ja: モデル読み込みのガードレール
ko: 모델 로드 가드레일
nl: Vangrails voor modellen laden
pl: Zabezpieczenia wczytywania modeli
pt_br: Proteções de carregamento de modelos
ru: Ограничители загрузки моделей
sv: Skyddsräcken för modellinläsning
tr: Model yükleme korumaları
uk: Запобіжники завантаження моделей
vi: Rào chắn khi tải mô hình
zh_hans: 模型加载防护
zh_hant: 模型載入防護

source: Model ready to load. Select a model or enter a prompt to begin.
ar: النموذج جاهز للتحميل. اختر نموذجًا أو أدخل نصًا للبدء.
de: Modell bereit zum Laden. Wählen Sie ein Modell oder geben Sie einen Prompt ein.
es: Modelo listo para cargar. Selecciona un modelo o escribe un mensaje para comenzar.
fr: Modèle prêt à être chargé. Sélectionnez un modèle ou saisissez une invite pour commencer.
he: המודל מוכן לטעינה. בחר מודל או הזן הנחיה כדי להתחיל.
hi: मॉडल लोड करने के लिए तैयार है। शुरू करने के लिए कोई मॉडल चुनें या प्रॉम्प्ट दर्ज करें।
id: Model siap dimuat. Pilih model atau masukkan prompt untuk memulai.
it: Modello pronto per il caricamento. Seleziona un modello o inserisci un prompt per iniziare.
ja: モデルを読み込む準備が整いました。モデルを選択するかプロンプトを入力してください。
ko: 모델을 로드할 준비가 되었습니다. 시작하려면 모델을 선택하거나 프롬프트를 입력하세요.
nl: Model gereed om te laden. Selecteer een model of voer een prompt in om te beginnen.
pl: Model gotowy do załadowania. Wybierz model lub wprowadź prompt, aby rozpocząć.
pt_br: Modelo pronto para carregar. Selecione um modelo ou digite um prompt para começar.
ru: Модель готова к загрузке. Выберите модель или введите запрос для начала.
sv: Modellen är redo att laddas. Välj en modell eller ange en prompt för att börja.
tr: Model yüklenmeye hazır. Başlamak için bir model seçin veya bir istem girin.
uk: Модель готова до завантаження. Виберіть модель або введіть запит, щоб розпочати.
vi: Mô hình đã sẵn sàng tải. Chọn một mô hình hoặc nhập lời nhắc để bắt đầu.
zh_hans: 模型已就绪。选择模型或输入提示词以开始。
zh_hant: 模型已就緒。選取模型或輸入提示詞以開始。

source: Model text
ar: نص النموذج
de: Modelltext
es: Texto del modelo
fr: Texte du modèle
he: טקסט המודל
hi: मॉडल टेक्स्ट
id: Teks model
it: Testo del modello
ja: モデルのテキスト
ko: 모델 텍스트
nl: Modeltekst
pl: Tekst modelu
pt_br: Texto do modelo
ru: Текст модели
sv: Modelltext
tr: Model metni
uk: Текст моделі
vi: Văn bản mô hình
zh_hans: 模型文本
zh_hant: 模型文字
